## TF Plan for app
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 14 to add, 4 to change, 14 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                                NAME                                 |
|----------|---------------------------------------------------------------------|
| add      | `aws_route53_record.validation_fr[&quot;*.ressources.alpha.canada.ca&quot;]`  |
|          | `aws_route53_record.validation_fr[&quot;ressources.alpha.canada.ca&quot;]`    |
|          | `aws_route53_record.validation_main[&quot;*.resources.alpha.canada.ca&quot;]` |
|          | `aws_route53_record.validation_main[&quot;resources.alpha.canada.ca&quot;]`   |
| delete   | `aws_route53_record.validation_fr[&quot;*.ressources.cdssandbox.xyz&quot;]`   |
|          | `aws_route53_record.validation_fr[&quot;ressources.cdssandbox.xyz&quot;]`     |
|          | `aws_route53_record.validation_main[&quot;*.resources.cdssandbox.xyz&quot;]`  |
|          | `aws_route53_record.validation_main[&quot;resources.cdssandbox.xyz&quot;]`    |
| update   | `aws_amplify_app.learning_resources`                                |
|          | `aws_amplify_app.lr_contentful_preview[0]`                          |
|          | `aws_amplify_branch.lr_staging`                                     |
|          | `aws_amplify_branch.main`                                           |
| recreate | `aws_acm_certificate.fr[0]`                                         |
|          | `aws_acm_certificate.main`                                          |
|          | `aws_acm_certificate_validation.fr[0]`                              |
|          | `aws_acm_certificate_validation.main`                               |
|          | `aws_amplify_domain_association.learning_resources_en`              |
|          | `aws_amplify_domain_association.learning_resources_fr`              |
|          | `aws_amplify_domain_association.learning_resources_staging_en`      |
|          | `aws_amplify_domain_association.learning_resources_staging_fr`      |
|          | `aws_amplify_domain_association.lr_contentful_preview_en[0]`        |
|          | `aws_amplify_domain_association.lr_contentful_preview_fr[0]`        |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_acm_certificate.fr[0] must be replaced
+/- resource "aws_acm_certificate" "fr" {
      ~ arn                       = "arn:aws:acm:ca-central-1:236007890657:certificate/75e819c0-3508-447b-841c-848752e77bf1" -> (known after apply)
      ~ domain_name               = "ressources.cdssandbox.xyz" -> "ressources.alpha.canada.ca" # forces replacement
      ~ domain_validation_options = [
          - {
              - domain_name           = "*.ressources.cdssandbox.xyz"
              - resource_record_name  = "_7c9fc6df0b598f7be74faae5abc143e3.ressources.cdssandbox.xyz."
              - resource_record_type  = "CNAME"
              - resource_record_value = "_da2d814dc8a5c1cc5c186997a6f6d173.htgdxnmnnj.acm-validations.aws."
            },
          - {
              - domain_name           = "ressources.cdssandbox.xyz"
              - resource_record_name  = "_7c9fc6df0b598f7be74faae5abc143e3.ressources.cdssandbox.xyz."
              - resource_record_type  = "CNAME"
              - resource_record_value = "_da2d814dc8a5c1cc5c186997a6f6d173.htgdxnmnnj.acm-validations.aws."
            },
            # (2 unchanged elements hidden)
        ]
      ~ id                        = "arn:aws:acm:ca-central-1:236007890657:certificate/75e819c0-3508-447b-841c-848752e77bf1" -> (known after apply)
      ~ status                    = "ISSUED" -> (known after apply)
      ~ subject_alternative_names = [ # forces replacement
          + "*.ressources.alpha.canada.ca",
          - "*.ressources.cdssandbox.xyz",
        ]
        tags                      = {
            "Environment" = "staging"
        }
      ~ validation_emails         = [] -> (known after apply)
        # (2 unchanged attributes hidden)

      - options {
          - certificate_transparency_logging_preference = "ENABLED" -> null
        }
    }

  # aws_acm_certificate.main must be replaced
+/- resource "aws_acm_certificate" "main" {
      ~ arn                       = "arn:aws:acm:ca-central-1:236007890657:certificate/5799d31d-cbfb-4096-905f-eb6d4c27ea53" -> (known after apply)
      ~ domain_name               = "resources.cdssandbox.xyz" -> "resources.alpha.canada.ca" # forces replacement
      ~ domain_validation_options = [
          - {
              - domain_name           = "*.resources.cdssandbox.xyz"
              - resource_record_name  = "_6cf406a4cf9bd3824ae37609fe3de836.resources.cdssandbox.xyz."
              - resource_record_type  = "CNAME"
              - resource_record_value = "_728743722fb17471fd9bfcf5ede0b629.htgdxnmnnj.acm-validations.aws."
            },
          - {
              - domain_name           = "resources.cdssandbox.xyz"
              - resource_record_name  = "_6cf406a4cf9bd3824ae37609fe3de836.resources.cdssandbox.xyz."
              - resource_record_type  = "CNAME"
              - resource_record_value = "_728743722fb17471fd9bfcf5ede0b629.htgdxnmnnj.acm-validations.aws."
            },
            # (2 unchanged elements hidden)
        ]
      ~ id                        = "arn:aws:acm:ca-central-1:236007890657:certificate/5799d31d-cbfb-4096-905f-eb6d4c27ea53" -> (known after apply)
      ~ status                    = "ISSUED" -> (known after apply)
      ~ subject_alternative_names = [ # forces replacement
          + "*.resources.alpha.canada.ca",
          - "*.resources.cdssandbox.xyz",
        ]
        tags                      = {
            "Environment" = "staging"
        }
      ~ validation_emails         = [] -> (known after apply)
        # (2 unchanged attributes hidden)

      - options {
          - certificate_transparency_logging_preference = "ENABLED" -> null
        }
    }

  # aws_acm_certificate_validation.fr[0] must be replaced
-/+ resource "aws_acm_certificate_validation" "fr" {
      ~ certificate_arn         = "arn:aws:acm:ca-central-1:236007890657:certificate/75e819c0-3508-447b-841c-848752e77bf1" -> (known after apply) # forces replacement
      ~ id                      = "2023-02-23 04:14:17.193 +0000 UTC" -> (known after apply)
      ~ validation_record_fqdns = [
          - "_7c9fc6df0b598f7be74faae5abc143e3.ressources.cdssandbox.xyz",
        ] -> (known after apply) # forces replacement
    }

  # aws_acm_certificate_validation.main must be replaced
-/+ resource "aws_acm_certificate_validation" "main" {
      ~ certificate_arn         = "arn:aws:acm:ca-central-1:236007890657:certificate/5799d31d-cbfb-4096-905f-eb6d4c27ea53" -> (known after apply) # forces replacement
      ~ id                      = "2023-02-23 04:14:18.719 +0000 UTC" -> (known after apply)
      ~ validation_record_fqdns = [
          - "_6cf406a4cf9bd3824ae37609fe3de836.resources.cdssandbox.xyz",
        ] -> (known after apply) # forces replacement
    }

  # aws_amplify_app.learning_resources will be updated in-place
  ~ resource "aws_amplify_app" "learning_resources" {
      ~ environment_variables         = {
          ~ "DOMAIN_EN"                   = "resources.cdssandbox.xyz" -> "resources.alpha.canada.ca"
          ~ "DOMAIN_FR"                   = "ressources.cdssandbox.xyz" -> "ressources.alpha.canada.ca"
          + "GOOGLE_ANALYTICS_ID"         = (sensitive)
          ~ "GOOGLE_TAG_MANAGER_ID"       = (sensitive)
            # (7 unchanged elements hidden)
        }
        id                            = "d2eeppmfu9s24m"
        name                          = "Learning Resources"
        tags                          = {}
        # (16 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # aws_amplify_app.lr_contentful_preview[0] will be updated in-place
  ~ resource "aws_amplify_app" "lr_contentful_preview" {
      ~ basic_auth_credentials        = (sensitive value)
      ~ environment_variables         = {
          ~ "DOMAIN_EN"                   = "preview.resources.cdssandbox.xyz" -> "preview.resources.alpha.canada.ca"
          ~ "DOMAIN_FR"                   = "preview.ressources.cdssandbox.xyz" -> "preview.ressources.alpha.canada.ca"
          + "GOOGLE_ANALYTICS_ID"         = (sensitive)
          ~ "GOOGLE_TAG_MANAGER_ID"       = (sensitive)
            # (8 unchanged elements hidden)
        }
        id                            = "d2wor6jqec5kxf"
        name                          = "LR Contentful Preview"
        tags                          = {}
        # (15 unchanged attributes hidden)

      + auto_branch_creation_config {}

        # (1 unchanged block hidden)
    }

  # aws_amplify_branch.lr_staging will be updated in-place
  ~ resource "aws_amplify_branch" "lr_staging" {
      ~ environment_variables         = {
          + "DOMAIN_EN" = "staging.resources.alpha.canada.ca"
          + "DOMAIN_FR" = "staging.ressources.alpha.canada.ca"
          + "ENV"       = "staging"
        }
        id                            = "d2eeppmfu9s24m/staging"
        tags                          = {}
        # (16 unchanged attributes hidden)
    }

  # aws_amplify_branch.main will be updated in-place
  ~ resource "aws_amplify_branch" "main" {
        id                            = "d2eeppmfu9s24m/main"
      - pull_request_environment_name = "RELEASE" -> null
        tags                          = {}
        # (16 unchanged attributes hidden)
    }

  # aws_amplify_domain_association.learning_resources_en must be replaced
-/+ resource "aws_amplify_domain_association" "learning_resources_en" {
      ~ arn                                 = "arn:aws:amplify:ca-central-1:236007890657:apps/d2eeppmfu9s24m/domains/resources.cdssandbox.xyz" -> (known after apply)
      ~ certificate_verification_dns_record = "_752cfec9ae9dfdfe061efa2c21273155.resources.cdssandbox.xyz. CNAME _ea2186b700c39019c735789983a6e258.htgdxnmnnj.acm-validations.aws." -> (known after apply)
      ~ domain_name                         = "resources.cdssandbox.xyz" -> "resources.alpha.canada.ca" # forces replacement
      ~ id                                  = "d2eeppmfu9s24m/resources.cdssandbox.xyz" -> (known after apply)
        # (2 unchanged attributes hidden)

      - sub_domain {
          - branch_name = "main" -> null
          - dns_record  = " CNAME d1cq1c9q035t64.cloudfront.net" -> null
          - verified    = false -> null
        }
      - sub_domain {
          - branch_name = "main" -> null
          - dns_record  = "www CNAME d1cq1c9q035t64.cloudfront.net" -> null
          - prefix      = "www" -> null
          - verified    = true -> null
        }
      + sub_domain {
          + branch_name = "main"
          + dns_record  = (known after apply)
          + verified    = (known after apply)
        }
      + sub_domain {
          + branch_name = "main"
          + dns_record  = (known after apply)
          + prefix      = "www"
          + verified    = (known after apply)
        }
    }

  # aws_amplify_domain_association.learning_resources_fr must be replaced
-/+ resource "aws_amplify_domain_association" "learning_resources_fr" {
      ~ arn                                 = "arn:aws:amplify:ca-central-1:236007890657:apps/d2eeppmfu9s24m/domains/ressources.cdssandbox.xyz" -> (known after apply)
      ~ certificate_verification_dns_record = "_d10c18e656dcd9396aee51ce9eb38596.ressources.cdssandbox.xyz. CNAME _63b8707542149c8ef36957333f153472.htgdxnmnnj.acm-validations.aws." -> (known after apply)
      ~ domain_name                         = "ressources.cdssandbox.xyz" -> "ressources.alpha.canada.ca" # forces replacement
      ~ id                                  = "d2eeppmfu9s24m/ressources.cdssandbox.xyz" -> (known after apply)
        # (2 unchanged attributes hidden)

      - sub_domain {
          - branch_name = "main" -> null
          - dns_record  = " CNAME d1ueafef9g5cik.cloudfront.net" -> null
          - verified    = false -> null
        }
      - sub_domain {
          - branch_name = "main" -> null
          - dns_record  = "www CNAME d1ueafef9g5cik.cloudfront.net" -> null
          - prefix      = "www" -> null
          - verified    = true -> null
        }
      + sub_domain {
          + branch_name = "main"
          + dns_record  = (known after apply)
          + verified    = (known after apply)
        }
      + sub_domain {
          + branch_name = "main"
          + dns_record  = (known after apply)
          + prefix      = "www"
          + verified    = (known after apply)
        }
    }

  # aws_amplify_domain_association.learning_resources_staging_en must be replaced
-/+ resource "aws_amplify_domain_association" "learning_resources_staging_en" {
      ~ arn                                 = "arn:aws:amplify:ca-central-1:236007890657:apps/d2eeppmfu9s24m/domains/staging.resources.cdssandbox.xyz" -> (known after apply)
      ~ certificate_verification_dns_record = "_8f5596c7b655a7c9636dac4c6a6b01d5.staging.resources.cdssandbox.xyz. CNAME _2d8aff2e3d03a7645b2893176854b296.htgdxnmnnj.acm-validations.aws." -> (known after apply)
      ~ domain_name                         = "staging.resources.cdssandbox.xyz" -> "staging.resources.alpha.canada.ca" # forces replacement
      ~ id                                  = "d2eeppmfu9s24m/staging.resources.cdssandbox.xyz" -> (known after apply)
        # (2 unchanged attributes hidden)

      - sub_domain {
          - branch_name = "staging" -> null
          - dns_record  = " CNAME d1cjo6bqeb4k90.cloudfront.net" -> null
          - verified    = false -> null
        }
      - sub_domain {
          - branch_name = "staging" -> null
          - dns_record  = "www CNAME d1cjo6bqeb4k90.cloudfront.net" -> null
          - prefix      = "www" -> null
          - verified    = true -> null
        }
      + sub_domain {
          + branch_name = "staging"
          + dns_record  = (known after apply)
          + verified    = (known after apply)
        }
      + sub_domain {
          + branch_name = "staging"
          + dns_record  = (known after apply)
          + prefix      = "www"
          + verified    = (known after apply)
        }
    }

  # aws_amplify_domain_association.learning_resources_staging_fr must be replaced
-/+ resource "aws_amplify_domain_association" "learning_resources_staging_fr" {
      ~ arn                                 = "arn:aws:amplify:ca-central-1:236007890657:apps/d2eeppmfu9s24m/domains/staging.ressources.cdssandbox.xyz" -> (known after apply)
      ~ certificate_verification_dns_record = "_0f85f7a11d5a6752753d6904ffa00e35.staging.ressources.cdssandbox.xyz. CNAME _57bfbb1f22a38562ded212adcacfce66.htgdxnmnnj.acm-validations.aws." -> (known after apply)
      ~ domain_name                         = "staging.ressources.cdssandbox.xyz" -> "staging.ressources.alpha.canada.ca" # forces replacement
      ~ id                                  = "d2eeppmfu9s24m/staging.ressources.cdssandbox.xyz" -> (known after apply)
        # (2 unchanged attributes hidden)

      - sub_domain {
          - branch_name = "staging" -> null
          - dns_record  = " CNAME d1nw0vdgnj5pws.cloudfront.net" -> null
          - verified    = false -> null
        }
      - sub_domain {
          - branch_name = "staging" -> null
          - dns_record  = "www CNAME d1nw0vdgnj5pws.cloudfront.net" -> null
          - prefix      = "www" -> null
          - verified    = true -> null
        }
      + sub_domain {
          + branch_name = "staging"
          + dns_record  = (known after apply)
          + verified    = (known after apply)
        }
      + sub_domain {
          + branch_name = "staging"
          + dns_record  = (known after apply)
          + prefix      = "www"
          + verified    = (known after apply)
        }
    }

  # aws_amplify_domain_association.lr_contentful_preview_en[0] must be replaced
-/+ resource "aws_amplify_domain_association" "lr_contentful_preview_en" {
      ~ arn                                 = "arn:aws:amplify:ca-central-1:236007890657:apps/d2wor6jqec5kxf/domains/preview.resources.cdssandbox.xyz" -> (known after apply)
      ~ certificate_verification_dns_record = "_865f2891c66d462c4a01ca583aa95207.preview.resources.cdssandbox.xyz. CNAME _d2b7b86dae1d5fc94b859f96e755eafa.mwfgkbkczp.acm-validations.aws." -> (known after apply)
      ~ domain_name                         = "preview.resources.cdssandbox.xyz" -> "preview.resources.alpha.canada.ca" # forces replacement
      ~ id                                  = "d2wor6jqec5kxf/preview.resources.cdssandbox.xyz" -> (known after apply)
        # (2 unchanged attributes hidden)

      - sub_domain {
          - branch_name = "staging" -> null
          - dns_record  = " CNAME d1w4iau738skxm.cloudfront.net" -> null
          - verified    = false -> null
        }
      - sub_domain {
          - branch_name = "staging" -> null
          - dns_record  = "www CNAME d1w4iau738skxm.cloudfront.net" -> null
          - prefix      = "www" -> null
          - verified    = true -> null
        }
      + sub_domain {
          + branch_name = "staging"
          + dns_record  = (known after apply)
          + verified    = (known after apply)
        }
      + sub_domain {
          + branch_name = "staging"
          + dns_record  = (known after apply)
          + prefix      = "www"
          + verified    = (known after apply)
        }
    }

  # aws_amplify_domain_association.lr_contentful_preview_fr[0] must be replaced
-/+ resource "aws_amplify_domain_association" "lr_contentful_preview_fr" {
      ~ arn                                 = "arn:aws:amplify:ca-central-1:236007890657:apps/d2wor6jqec5kxf/domains/preview.ressources.cdssandbox.xyz" -> (known after apply)
      ~ certificate_verification_dns_record = "_2768dd2c0354a7a9d17d852aa1e5c5c2.preview.ressources.cdssandbox.xyz. CNAME _62ad247d52d6a1d4838dbdbf0b8814ba.mwfgkbkczp.acm-validations.aws." -> (known after apply)
      ~ domain_name                         = "preview.ressources.cdssandbox.xyz" -> "preview.ressources.alpha.canada.ca" # forces replacement
      ~ id                                  = "d2wor6jqec5kxf/preview.ressources.cdssandbox.xyz" -> (known after apply)
        # (2 unchanged attributes hidden)

      - sub_domain {
          - branch_name = "staging" -> null
          - dns_record  = " CNAME d3gz96v9ftx3w7.cloudfront.net" -> null
          - verified    = false -> null
        }
      - sub_domain {
          - branch_name = "staging" -> null
          - dns_record  = "www CNAME d3gz96v9ftx3w7.cloudfront.net" -> null
          - prefix      = "www" -> null
          - verified    = true -> null
        }
      + sub_domain {
          + branch_name = "staging"
          + dns_record  = (known after apply)
          + verified    = (known after apply)
        }
      + sub_domain {
          + branch_name = "staging"
          + dns_record  = (known after apply)
          + prefix      = "www"
          + verified    = (known after apply)
        }
    }

  # aws_route53_record.validation_fr["*.ressources.alpha.canada.ca"] will be created
  + resource "aws_route53_record" "validation_fr" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z100327421OOLKYRWTNPC"
    }

  # aws_route53_record.validation_fr["*.ressources.cdssandbox.xyz"] will be destroyed
  - resource "aws_route53_record" "validation_fr" {
      - allow_overwrite                  = true -> null
      - fqdn                             = "_7c9fc6df0b598f7be74faae5abc143e3.ressources.cdssandbox.xyz" -> null
      - id                               = "Z100327421OOLKYRWTNPC__7c9fc6df0b598f7be74faae5abc143e3.ressources.cdssandbox.xyz._CNAME" -> null
      - multivalue_answer_routing_policy = false -> null
      - name                             = "_7c9fc6df0b598f7be74faae5abc143e3.ressources.cdssandbox.xyz" -> null
      - records                          = [
          - "_da2d814dc8a5c1cc5c186997a6f6d173.htgdxnmnnj.acm-validations.aws.",
        ] -> null
      - ttl                              = 60 -> null
      - type                             = "CNAME" -> null
      - zone_id                          = "Z100327421OOLKYRWTNPC" -> null
    }

  # aws_route53_record.validation_fr["ressources.alpha.canada.ca"] will be created
  + resource "aws_route53_record" "validation_fr" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z100327421OOLKYRWTNPC"
    }

  # aws_route53_record.validation_fr["ressources.cdssandbox.xyz"] will be destroyed
  - resource "aws_route53_record" "validation_fr" {
      - allow_overwrite                  = true -> null
      - fqdn                             = "_7c9fc6df0b598f7be74faae5abc143e3.ressources.cdssandbox.xyz" -> null
      - id                               = "Z100327421OOLKYRWTNPC__7c9fc6df0b598f7be74faae5abc143e3.ressources.cdssandbox.xyz._CNAME" -> null
      - multivalue_answer_routing_policy = false -> null
      - name                             = "_7c9fc6df0b598f7be74faae5abc143e3.ressources.cdssandbox.xyz" -> null
      - records                          = [
          - "_da2d814dc8a5c1cc5c186997a6f6d173.htgdxnmnnj.acm-validations.aws.",
        ] -> null
      - ttl                              = 60 -> null
      - type                             = "CNAME" -> null
      - zone_id                          = "Z100327421OOLKYRWTNPC" -> null
    }

  # aws_route53_record.validation_main["*.resources.alpha.canada.ca"] will be created
  + resource "aws_route53_record" "validation_main" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z100274221H572EV8LN4D"
    }

  # aws_route53_record.validation_main["*.resources.cdssandbox.xyz"] will be destroyed
  - resource "aws_route53_record" "validation_main" {
      - allow_overwrite                  = true -> null
      - fqdn                             = "_6cf406a4cf9bd3824ae37609fe3de836.resources.cdssandbox.xyz" -> null
      - id                               = "Z100274221H572EV8LN4D__6cf406a4cf9bd3824ae37609fe3de836.resources.cdssandbox.xyz._CNAME" -> null
      - multivalue_answer_routing_policy = false -> null
      - name                             = "_6cf406a4cf9bd3824ae37609fe3de836.resources.cdssandbox.xyz" -> null
      - records                          = [
          - "_728743722fb17471fd9bfcf5ede0b629.htgdxnmnnj.acm-validations.aws.",
        ] -> null
      - ttl                              = 60 -> null
      - type                             = "CNAME" -> null
      - zone_id                          = "Z100274221H572EV8LN4D" -> null
    }

  # aws_route53_record.validation_main["resources.alpha.canada.ca"] will be created
  + resource "aws_route53_record" "validation_main" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z100274221H572EV8LN4D"
    }

  # aws_route53_record.validation_main["resources.cdssandbox.xyz"] will be destroyed
  - resource "aws_route53_record" "validation_main" {
      - allow_overwrite                  = true -> null
      - fqdn                             = "_6cf406a4cf9bd3824ae37609fe3de836.resources.cdssandbox.xyz" -> null
      - id                               = "Z100274221H572EV8LN4D__6cf406a4cf9bd3824ae37609fe3de836.resources.cdssandbox.xyz._CNAME" -> null
      - multivalue_answer_routing_policy = false -> null
      - name                             = "_6cf406a4cf9bd3824ae37609fe3de836.resources.cdssandbox.xyz" -> null
      - records                          = [
          - "_728743722fb17471fd9bfcf5ede0b629.htgdxnmnnj.acm-validations.aws.",
        ] -> null
      - ttl                              = 60 -> null
      - type                             = "CNAME" -> null
      - zone_id                          = "Z100274221H572EV8LN4D" -> null
    }

Plan: 14 to add, 4 to change, 14 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.fr[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.main"]
WARN - plan.json - main - Missing Common Tags: ["aws_amplify_app.learning_resources"]
WARN - plan.json - main - Missing Common Tags: ["aws_amplify_app.lr_contentful_preview[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_amplify_branch.lr_contentful_preview_staging[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_amplify_branch.lr_staging"]
WARN - plan.json - main - Missing Common Tags: ["aws_amplify_branch.main"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecr_repository.learning_resources"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.app"]
WARN - plan.json - main - Missing Common Tags: ["aws_route53_zone.en_learning_resources"]
WARN - plan.json - main - Missing Common Tags: ["aws_route53_zone.fr_learning_resources"]
WARN - plan.json - main - Missing Common Tags: ["aws_route53_zone.legacy_learning_resources[0]"]

29 tests, 17 passed, 12 warnings, 0 failures, 0 exceptions

```

</details>
